c5/src/InformationRegisters/ItemAccounts/ItemAccounts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ItemAccounts</name>
  <resources>
    <name>Account</name>
    <type>
      <types>ChartOfAccountsRef.General</types>
    </type>
  </resources>
  <resources>
    <name>Department</name>
    <type>
      <types>CatalogRef.Departments</types>
    </type>
  </resources>
  <resources>
    <name>Expense</name>
    <type>
      <types>CatalogRef.Expenses</types>
    </type>
  </resources>
  <resources>
    <name>ExpenseAccount</name>
    <type>
      <types>ChartOfAccountsRef.General</types>
    </type>
  </resources>
  <resources>
    <name>VAT</name>
    <type>
      <types>ChartOfAccountsRef.General</types>
    </type>
  </resources>
  <resources>
    <name>Income</name>
    <type>
      <types>ChartOfAccountsRef.General</types>
    </type>
  </resources>
  <resources>
    <name>SalesCost</name>
    <type>
      <types>ChartOfAccountsRef.General</types>
    </type>
  </resources>
  <dimensions>
    <name>Item</name>
    <type>
      <types>CatalogRef.Items</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Warehouse</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

c5/src/InformationRegisters/ItemAccounts/Forms/Form/Module.bsl
// *****************************************
// *********** Form events

&AtServer
Procedure OnReadAtServer ( CurrentObject )
	
	defineService ( ThisObject );
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtClientAtServerNoContext
Procedure defineService ( Form )
	
	item = Form.Record.Item;
	Form.Service = item.IsEmpty () or DF.Pick ( item, "Service", true );
	
EndProcedure 

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	if ( Record.SourceRecordKey.IsEmpty () ) then
		init ();
	endif; 
	readAppearance ();
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtServer
Procedure readAppearance ()

	rules = new Array ();
	rules.Add ( "
	|GroupExpense enable Service;
	|ExpenseAccount enable not Service
	|" );
	Appearance.Read ( ThisObject, rules );

EndProcedure

&AtServer
Procedure init ()
	
	if ( not Record.Item.IsEmpty () ) then
		defineService ( ThisObject );
	endif; 
	
EndProcedure 

// *****************************************
// *********** Group Form

&AtClient
Procedure ItemOnChange ( Item )
	
	defineService ( ThisObject );
	resetExpenses ();
	
EndProcedure

&AtClient
Procedure resetExpenses ()
	
	
	if ( Service ) then
		Record.ExpenseAccount = undefined;
	else
		Record.Expense = undefined;
		Record.Department = undefined;
	endif; 
	Appearance.Apply ( ThisObject, "Service" );
	
EndProcedure
